#pndas loc:access a group of rows and column by label(s) or a boolean array

In [1]:
import pandas as pd

In [4]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book6.csv')
df

    id  class  study  media
0  101     10      3      2
1  102     10      4      3
2  103     11      5      4
3  104     12      6      5
4  105      9      7      6

In [5]:
df.loc[0]

id       101
class     10
study      3
media      2
Name: 0, dtype: int64

In [6]:
df.loc[4]

id       105
class      9
study      7
media      6
Name: 4, dtype: int64

In [7]:
df.loc[[2,4]]

    id  class  study  media
2  103     11      5      4
4  105      9      7      6

#to access particular value

In [8]:
df.loc[4,'study']  #dataframe.loc[index,column-name]

7

#slicing

In [9]:
df.loc[0:3]

    id  class  study  media
0  101     10      3      2
1  102     10      4      3
2  103     11      5      4
3  104     12      6      5

In [10]:
df.loc[0:3,'study']

0    3
1    4
2    5
3    6
Name: study, dtype: int64

In [11]:
df.loc[0:]

    id  class  study  media
0  101     10      3      2
1  102     10      4      3
2  103     11      5      4
3  104     12      6      5
4  105      9      7      6

#obtaining by boolean list

In [14]:
df.loc[[False,True,True,False,True]]

    id  class  study  media
1  102     10      4      3
2  103     11      5      4
4  105      9      7      6

#conditional operator

In [15]:
#if want the values of column class which contain less than 11 values
df.loc[df['class']<11]

    id  class  study  media
0  101     10      3      2
1  102     10      4      3
4  105      9      7      6

In [16]:
#i want above condition and want to print only values of column media 
df.loc[df['class']<11,['media']]

   media
0      2
1      3
4      6

#iloc[]:integer location based indexing

In [18]:
df

    id  class  study  media
0  101     10      3      2
1  102     10      4      3
2  103     11      5      4
3  104     12      6      5
4  105      9      7      6

In [19]:
df.iloc[0]

id       101
class     10
study      3
media      2
Name: 0, dtype: int64

In [20]:
df.iloc[[0]]

    id  class  study  media
0  101     10      3      2

In [21]:
df.iloc[[2,3,]]

    id  class  study  media
2  103     11      5      4
3  104     12      6      5

In [22]:
df.iloc[:,1]

0    10
1    10
2    11
3    12
4     9
Name: class, dtype: int64

In [23]:
df.iloc[[True,True,False,False,False]]

    id  class  study  media
0  101     10      3      2
1  102     10      4      3